# Checklist
ขั้นตอนทั้งหมดที่ต้องทำกับทุกตาราง
1. Name 
2. Type (Category, int/float, bounded/unbounded, text, structured, etc.)
3. % of missing values
4. Type of distribution (Gaussian, uniform, logarithmic, etc.)
5. Noisiness and type of noise (stochastic, outliers, rounding errors, etc.)
6. Possibly useful for the task?

# Ideabook

In [2]:
import pandas as pd

ideabook = pd.read_csv('../../2_data/20180319/ideabook.csv')
print(ideabook.shape)
ideabook.head()

(41735, 5)

  IDEABOOK_ID CUSTOMER_ID            NAME DESCRIPTION  IDEABOOK_TYPE
0       2,020       1,042  Mobile uploads         NaN  MOBILE_UPLOAD
1       3,060       2,082  Mobile uploads         NaN  MOBILE_UPLOAD
2       3,080       2,102  Mobile uploads         NaN  MOBILE_UPLOAD
3       3,141       2,163  Mobile uploads         NaN  MOBILE_UPLOAD
4       3,204       2,226  Mobile uploads         NaN  MOBILE_UPLOAD

In [5]:
ideabook['NAME'].unique()

array(['Mobile uploads', 'Home Decoration', 'Supalai Rachathewee', ...,
       'ตู้โชว์ 1', 'diningroom', 'B-DOHS'], dtype=object)

In [7]:
ideabook['IDEABOOK_TYPE'].unique()

array(['MOBILE_UPLOAD', 'ITEM'], dtype=object)

### 2. Type (Category, int/float, bounded/unbounded, text, structured, etc.)

In [8]:
ideabook.dtypes

IDEABOOK_ID      object
CUSTOMER_ID      object
NAME             object
DESCRIPTION      object
IDEABOOK_TYPE    object
dtype: object

id ต้องเป็น int

In [10]:
import locale
locale.setlocale(locale.LC_ALL, '') 

new_ideabook = ideabook[:]
new_ideabook['IDEABOOK_ID'] = ideabook['IDEABOOK_ID'].apply(locale.atoi)
new_ideabook['CUSTOMER_ID'] = ideabook['CUSTOMER_ID'].apply(locale.atoi)
new_ideabook.head()

   IDEABOOK_ID  CUSTOMER_ID            NAME DESCRIPTION  IDEABOOK_TYPE
0         2020         1042  Mobile uploads         NaN  MOBILE_UPLOAD
1         3060         2082  Mobile uploads         NaN  MOBILE_UPLOAD
2         3080         2102  Mobile uploads         NaN  MOBILE_UPLOAD
3         3141         2163  Mobile uploads         NaN  MOBILE_UPLOAD
4         3204         2226  Mobile uploads         NaN  MOBILE_UPLOAD

In [12]:
new_ideabook.dtypes

IDEABOOK_ID       int64
CUSTOMER_ID       int64
NAME             object
DESCRIPTION      object
IDEABOOK_TYPE    object
dtype: object

In [13]:
new_ideabook.isnull().sum(axis=0)

IDEABOOK_ID          0
CUSTOMER_ID          0
NAME                 1
DESCRIPTION      41417
IDEABOOK_TYPE        0
dtype: int64

### Export to CSV

In [14]:
new_ideabook.to_csv('../../2_data/explored/ideabook.csv', index = False)

# Ideabook Item

In [15]:
ideabook_item = pd.read_csv('../../2_data/20180319/ideabook_item.csv')
print(ideabook_item.shape)
ideabook_item.head()

(21463, 7)

,ITEM_ID,IDEABOOK_ID,MATNR,INSPIRATION_ID,IMAGE_ID,ITEM_TYPE,PHOTO_ID
0,"2,002",981,NaN,144,NaN,INSPIRATION,NaN
1,"3,103","3,225",19014714.0,NaN,NaN,MDM_CYBER,NaN
2,"3,104","3,225",59008884.0,NaN,NaN,MDM_CYBER,NaN
3,"3,149","3,330",19077181.0,NaN,NaN,MDM_CYBER,NaN
4,"3,323","3,501",19055703.0,NaN,NaN,MDM_CYBER,NaN

In [16]:
ideabook_item.isnull().sum(axis=0)

ITEM_ID               0
IDEABOOK_ID           0
MATNR              1716
INSPIRATION_ID    20122
IMAGE_ID          21463
ITEM_TYPE             0
PHOTO_ID          21089
dtype: int64

### 2. Type (Category, int/float, bounded/unbounded, text, structured, etc.)

In [19]:
ideabook_item.dtypes

ITEM_ID            object
IDEABOOK_ID        object
MATNR             float64
INSPIRATION_ID     object
IMAGE_ID          float64
ITEM_TYPE          object
PHOTO_ID           object
dtype: object

id ต้อง เป็น int

In [22]:
import locale
locale.setlocale(locale.LC_ALL, '') 

new_ideabook_item = ideabook_item[:]
new_ideabook_item['IDEABOOK_ID'] = ideabook_item['IDEABOOK_ID'].apply(locale.atoi)
new_ideabook_item['ITEM_ID'] = ideabook_item['ITEM_ID'].apply(locale.atoi)
print(new_ideabook_item.shape)
new_ideabook_item.head()

(21463, 7)

,ITEM_ID,IDEABOOK_ID,MATNR,INSPIRATION_ID,IMAGE_ID,ITEM_TYPE,PHOTO_ID
0,2002,981,NaN,144,NaN,INSPIRATION,NaN
1,3103,3225,19014714.0,NaN,NaN,MDM_CYBER,NaN
2,3104,3225,59008884.0,NaN,NaN,MDM_CYBER,NaN
3,3149,3330,19077181.0,NaN,NaN,MDM_CYBER,NaN
4,3323,3501,19055703.0,NaN,NaN,MDM_CYBER,NaN

### 3. % of missing values

In [23]:
new_ideabook_item.isnull().sum(axis=0)

ITEM_ID               0
IDEABOOK_ID           0
MATNR              1716
INSPIRATION_ID    20122
IMAGE_ID          21463
ITEM_TYPE             0
PHOTO_ID          21089
dtype: int64

In [28]:
if 'IMAGE_ID' in new_ideabook_item:
    del new_ideabook_item['IMAGE_ID']
if 'PHOTO_ID' in new_ideabook_item:
    del new_ideabook_item['PHOTO_ID']
if 'INSPIRATION_ID' in new_ideabook_item:
    del new_ideabook_item['INSPIRATION_ID']

In [31]:
new_ideabook_item.head()

   ITEM_ID  IDEABOOK_ID       MATNR    ITEM_TYPE
0     2002          981         NaN  INSPIRATION
1     3103         3225  19014714.0    MDM_CYBER
2     3104         3225  59008884.0    MDM_CYBER
3     3149         3330  19077181.0    MDM_CYBER
4     3323         3501  19055703.0    MDM_CYBER

### Export to CSV

In [32]:
new_ideabook_item.to_csv('../../2_data/explored/ideabook_item.csv', index = False)

# Ideabook + Item

In [33]:
left = new_ideabook
left.head()

   IDEABOOK_ID  CUSTOMER_ID            NAME DESCRIPTION  IDEABOOK_TYPE
0         2020         1042  Mobile uploads         NaN  MOBILE_UPLOAD
1         3060         2082  Mobile uploads         NaN  MOBILE_UPLOAD
2         3080         2102  Mobile uploads         NaN  MOBILE_UPLOAD
3         3141         2163  Mobile uploads         NaN  MOBILE_UPLOAD
4         3204         2226  Mobile uploads         NaN  MOBILE_UPLOAD

In [34]:
right = new_ideabook_item
right.head()

   ITEM_ID  IDEABOOK_ID       MATNR    ITEM_TYPE
0     2002          981         NaN  INSPIRATION
1     3103         3225  19014714.0    MDM_CYBER
2     3104         3225  59008884.0    MDM_CYBER
3     3149         3330  19077181.0    MDM_CYBER
4     3323         3501  19055703.0    MDM_CYBER

In [35]:
ideabook_item_merge = pd.merge(left, right, on='IDEABOOK_ID')
ideabook_item_merge.head()

,IDEABOOK_ID,CUSTOMER_ID,NAME,DESCRIPTION,IDEABOOK_TYPE,ITEM_ID,MATNR,ITEM_TYPE
0,3334,2342,Home Decoration,NaN,ITEM,3153,19088103.0,MDM_CYBER
1,3905,2987,Supalai Rachathewee,NaN,ITEM,3582,59008375.0,MDM_CYBER
2,3905,2987,Supalai Rachathewee,NaN,ITEM,3584,59007937.0,MDM_CYBER
3,3905,2987,Supalai Rachathewee,NaN,ITEM,3625,59003359.0,MDM_CYBER
4,3905,2987,Supalai Rachathewee,NaN,ITEM,3626,59000177.0,MDM_CYBER

In [36]:
ideabook_item_merge.isnull().sum(axis=0)

IDEABOOK_ID          0
CUSTOMER_ID          0
NAME                 3
DESCRIPTION      20093
IDEABOOK_TYPE        0
ITEM_ID              0
MATNR             1716
ITEM_TYPE            0
dtype: int64

In [37]:
ideabook_item_merge.dtypes

IDEABOOK_ID        int64
CUSTOMER_ID        int64
NAME              object
DESCRIPTION       object
IDEABOOK_TYPE     object
ITEM_ID            int64
MATNR            float64
ITEM_TYPE         object
dtype: object

### Export file

In [39]:
ideabook_item_merge.to_csv('../../2_data/prepared/ideabook_item_merge.csv', index=False)